In [1]:
import pandas as pd
print("Pandas version:", pd.__version__)

Pandas version: 2.2.2

In [6]:
df =pd.read_csv("personas.csv" , sep=";")

# Mostrar las primeras filas del DataFrame
print(df.head())
df.head()

   Nombre  Edad     Ciudad  Unnamed: 3
0    Juan    26     Ibague         NaN
1   Pedro    56  Monterrey         NaN
2  Camilo    15     Bogota         NaN

   Nombre  Edad     Ciudad  Unnamed: 3
0    Juan    26     Ibague         NaN
1   Pedro    56  Monterrey         NaN
2  Camilo    15     Bogota         NaN

In [2]:




# calcula la edad promedio de las personas en el DataFrame
promedio = df['Edad'].mean()
print(f"La edad promedio es: {promedio}")

NameError: name 'df' is not defined

In [1]:
# Verificar si hay valores nulos en el DataFrame
df.isnull().sum()

NameError: name 'df' is not defined